Repository: IoannisDem/GF2-final
Catalog: logsim/logsim_*.po
Languages: el_gr

source: &About
el_gr: &Σχετικά με

source: &Colour
el_gr: &Χρώμα

source: &Dev Info
el_gr: &Πληροφορίες

source: &Exit
el_gr: &Εξοδος

source: &File
el_gr: &Αρχείο

source: &Help
el_gr: &Βοήθεια

source: &Magenta
el_gr: &Ματσέντα

source: &Monochrome
el_gr: &Μονόχρωμο

source: &Open
el_gr: &Ανοιξε

source: &Purple
el_gr: &Μωβ

source: &Red
el_gr: &Κόκκινο

source: &View
el_gr: &Προβολή

source: > ERROR: {}
el_gr: > ΣΦΑΛΜΑ: {}

source: > Errors in definition file. Code cannot be compiled. Fix errors, then re-open file.
el_gr: > Σφάλματα στο αρχείο ορισμού. Ο κώδικας δεν μπορεί να συντακεί. Διορθώστε σφάλματα και 'ανοιξε ξανά το αρχείο.

source: > Number of errors detected:{}
el_gr: > Αριθμός σφαλμάτων που εντοπίστηκαν:{}

source: About Logsim
el_gr: Σχετικά με 'logsim'

source: Changing colour scheme to Magenta
el_gr: Αλλαγή χρώματος σε ματζέντα

source: Changing colour scheme to Monochrome
el_gr: Αλλαγή χρώματος σε μονόχρωμο

source: Changing colour scheme to Purple
el_gr: Αλλαγή χρώματος σε μωβ

source: Changing colour scheme to Red
el_gr: Αλλαγή χρώματος σε κόκκινο

source: Compile
el_gr: Συντάσσω

source: Connect
el_gr: Σύνδεση

source: Continue
el_gr: Προχώρα

source: Continuing for {} cycles. Total: {} cycles.
el_gr: Συνεχισαι για {} κύκλους. Σύνολο: {} κύκλοι.

source: Could not change switch state.
el_gr: Δεν ήταν δυνατή η αλλαγή της κατάστασης του διακόπτη.

source: Cycles:
el_gr: Κύκλοι:

source: Definition file compiled.
el_gr: Αρχείο ορισμού συντάκτικε.

source: Developer mode toggled.
el_gr: Εναλλαγή της λειτουργίας προγραμματιστή.

source: Device {} now monitored.
el_gr: Συσκευή {} παρακολουθείται.

source: Device {} now unmonitored.
el_gr: Συσκευή {} ελευθερώνεται.

source: Disconnect
el_gr: Αποσύνδεση

source: Down arrow press. Scrolling down:
el_gr: Πατήστε το κάτω βέλος. κύλιση προς τα κάτω:

source: Edit Connections
el_gr: Ενώσεις

source: Edit Monitors
el_gr: Οθόνες

source: Edit Switches
el_gr: Διακόπτες

source: Error
el_gr: Σφάλμα

source: Error display
el_gr: Εμφάνιση σφάλματος

source: Input {} connected to {}
el_gr: Εισαγωγή {} ενωμένο στο {}

source: Input {} disconnected
el_gr: Εισαγωγή {} αποσύνδεση

source: Inputs
el_gr: Εισαγωγές

source: Left arrow press. Scrolling left:
el_gr: Πατήστε το αριστερό βέλος. Κύλιση αριστερά:

source: Logic Simulator, Team 17
el_gr: Logic Simulator, Ομάδα 17

source: Monitored
el_gr: Παρακολούθηση

source: Monitors button pressed.
el_gr: Πατήθηκε το κουμπί οθονών.

source: Mouse button pressed at:
el_gr: Το κουμπί του ποντικιού πατιέται στο:

source: Mouse button released at:
el_gr: Το κουμπί του ποντικιού ελευθερώθηκε:

source: Mouse left canvas at:
el_gr: Αριστερός καμβάς του ποντικιού στο:

source: Negative mouse wheel rotation. Scrolling down:
el_gr: Αρνητική περιστροφή τροχού ποντικιού. Κύλιση προς τα κάτω:

source: New number of cycles per execution:
el_gr: Νέος αριθμός κύκλων ανά εκτέλεση:

source: Open file cancelled.
el_gr: Ακύρωση ανοίγματος αρχέιου.

source: Opening file=
el_gr: Άνοιγμα αρχείου=

source: Outputs
el_gr: Εξόδοι

source: Positive mouse wheel rotation. Scrolling up:
el_gr: Θετική περιστροφή τροχού ποντικιού. Κύλιση προς τα πάνω:

source: Remove ▶
el_gr: Αφαίρεση ▶

source: Resetting view
el_gr: Επαναφορά προβολής

source: Right arrow press. Scrolling right:
el_gr: Πατήστε το δεξί βέλος. Κύλιση δεξιά:

source: Run
el_gr: Τρέξιμο

source: Scrolling left: {}.
el_gr: Κύλιση αριστερά: {}.

source: Scrolling right: {}.
el_gr: Κύλιση δεξιά: {}.

source: Simulated Signals
el_gr: Προσομοιωμένα σήματα

source: Simulation running for {} cycles
el_gr: Η προσομοίωση εκτελείται για {} κύκλους

source: Some inputs were left disconnected. System may oscillate.
el_gr: Κάποιες εισαγωγές δεν ενώθηκαν. Το σύστημα ταλαντεύεται.

source: Switch ON
el_gr: Άνοιξε

source: Switch {} set to {}.
el_gr: Ο διακόπτης {} ορίστηκε σε {}.

source: Switches button pressed.
el_gr: Το κουμπί διακόπτη πατημένο.

source: Trace {}
el_gr: Ιχνος {}

source: Unmonitored
el_gr: Ελευθερώνεται

source: Up arrow press. Scrolling up:
el_gr: Πατήστε το επάνω βέλος. Κύλιση προς τα πάνω:

source: ◀ Add
el_gr: ◀ Προσθήκη

source: Must specify an output
el_gr: Προσδιοόρισε έξοδο

source: NON-USER ERROR
el_gr: Όχι λάθος χειρηστή

source: The chosen (device_id, output_id) exists in the dictionary
el_gr: Η συγκεκριμένη συσκευή (device_id, output_id) υπάρχει στο λεξικό

source: The port does not exist or is not an input port
el_gr: Η είσοδος δεν υπάρχει ή δεν είναι είσοδος

source: The specified device is not an output and cannot be monitored
el_gr: Δεν είναι έξοδος και δεν μπορεί να ελεγκτεί

source: Trying connect output of a device to another device output.
el_gr: Ένωση εξόδου συσκευής σε άλλη έξοδο.

source: Trying to access an invalid input or output port.
el_gr: Πρόσβαση σε λάθος είσοδο ή έξοδο.

source: Trying to access or monitor a device which has not been created.
el_gr: Πρόσβαση ή έξοδος συσκευής που δεν δημιουργήθηκε.

source: Trying to connect a device to an input pin which is already connected to another device.
el_gr: Ένωση σε είσοδο συσκευής σε είσοδο που είναι ενωμένη σε άλλη συσκευή.

source: Trying to connect input of a device to another device input.
el_gr: Ένωση είσοδος συσκευής σε άλλη είσοδο.

source: Trying to define a device that already exists.
el_gr: Δημιουργία συσκευής που υπάρχει.
